Revit 2027 API
AssemblyInstance.PlaceInstance Method
 Places an assembly instance of a given assembly type at the specified location.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static AssemblyInstance PlaceInstance(
	Document document,
	ElementId assemblyTypeId,
	XYZ location
)
Public Shared Function PlaceInstance (
	document As Document,
	assemblyTypeId As ElementId,
	location As XYZ
) As AssemblyInstance
public:
static AssemblyInstance^ PlaceInstance(
	Document^ document,
	ElementId^ assemblyTypeId,
	XYZ^ location
)
static member PlaceInstance :
        document : Document *
        assemblyTypeId : ElementId *
        location : XYZ -> AssemblyInstance
Parameters
document Document
 The document for the new assembly instance.
assemblyTypeId ElementId
 The id of the assembly type to be used for the instance.
location XYZ
 The placement location for the instance in project coordinates.
Return Value
AssemblyInstance
 The newly created assembly instance.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AssemblyInstance Class
Autodesk.Revit.DB Namespace